package com.example.pokemon.place;

import javafx.event.ActionEvent;
import javafx.fxml.FXML;
import javafx.fxml.FXMLLoader;
import javafx.scene.Node;
import javafx.scene.Parent;
import javafx.scene.Scene;
import javafx.scene.control.TextArea;
import javafx.stage.Stage;

import java.io.FileNotFoundException;
import java.io.IOException;
import java.net.URL;

public class Guandu {
    @FXML
    private void goBack(ActionEvent event) throws IOException {
        URL fxmlUrl = getClass().getResource("/com/example/pokemon/strategy.fxml");
        if (fxmlUrl == null) {
            throw new FileNotFoundException("FXML file not found: /com/example/pokemon/strategy.fxml");
        }
        FXMLLoader loader = new FXMLLoader(fxmlUrl);
        Parent root = loader.load();
        Stage stage = (Stage) ((Node) event.getSource()).getScene().getWindow();
        stage.setScene(new Scene(root));
        stage.show();
    }


    @FXML
    private TextArea displayArea;
    @FXML
    public void initialize() {
        String content ="地点/NPC\t等级\t奖金\n" +
                "常磐森林\n" +
                "捕虫少年\t45\t1476\n" +
                "捕虫少年\t45\t1476\n" +
                "捕虫少年\t45\t1476\n" +
                "捕虫少年\t45\t1476\n" +
                "捕虫少年\t45\t1476\n" +
                "\n-----------------------------\n\n" +

                "3号道路\n" +
                "迷你裙\t40\t984\n" +
                "捕虫少年\t40\t738\n" +
                "短裤小子\t40\t984\n" +
                "短裤小子\t40\t984\n" +
                "捕虫少年\t40\t738\n" +
                "迷你裙\t40\t936\n" +
                "捕虫少年\t40\t702\n" +
                "迷你裙\t40\t936\n" +
                "\n-----------------------------\n\n" +

                "月见山\n" +
                "迷你裙\t40\t960\t1F\n" +
                "捕虫少年\t40\t702\t1F\n" +
                "理科男\t50\t1728\t1F\n" +
                "捕虫少年\t40\t738\t1F\n" +
                "迷你裙\t40\t960\t1F\n" +
                "短裤小子\t40\t960\t1F\n" +
                "登山男\t50\t2538\t1F\n" +
                "\n-----------------------------\n\n" +

                "4号道路\n" +
                "迷你裙\t40\t936\t需要冲浪\n" +
                "\n-----------------------------\n\n" +

                "24号道路\n" +
                "捕虫少年\t40\t738\n" +
                "迷你裙\t40\t960\n" +
                "短裤小子\t45\t960\n" +
                "迷你裙\t40\t960\n" +
                "露营少年\t45\t1260\n" +
                "露营少年\t45\t1260\n" +
                "\n-----------------------------\n\n" +

                "25号道路\n" +
                "登山男\t50\t2592\n" +
                "登山男\t50\t2484\n" +
                "短裤小子\t45\t936\n" +
                "短裤小子\t40\t1200\n" +
                "野餐少女\t45\t1230\n" +
                "登山男\t50\t2538\n" +
                "露营少年\t45\t1260\n" +
                "短裤小子\t40\t960\n" +
                "迷你裙\t40\t960\n" +
                "\n-----------------------------\n\n" +

                "9号道路\n" +
                "野餐少女\t45\t1200\n" +
                "登山男\t50\t2592\n" +
                "露营少年\t45\t1260\n" +
                "捕虫少年\t40\t738\n" +
                "捕虫少年\t40\t738\n" +
                "露营少年\t45\t1260\n" +
                "登山男\t50\t2268\n" +
                "野餐少女\t45\t1260\n" +
                "登山男\t50\t2538\n" +
                "\n-----------------------------\n\n" +

                "10号道路\n" +
                "野餐少女\t45\t1230\t北部\n" +
                "怪物狂\t50\t3780\t北部\t需要冲浪\n" +
                "野餐少女\t45\t1230\t南部\n" +
                "登山男\t50\t2592\t南部\n" +
                "登山男\t50\t2592\t南部\n" +
                "怪物狂\t50\t3948\t南部\n" +
                "\n-----------------------------\n\n" +

                "岩山隧道\n" +
                "怪物狂\t50\t3780\t1F\n" +
                "怪物狂\t50\t3864\t2F\n" +
                "野餐少女\t45\t1230\t2F\n" +
                "怪物狂\t50\t3948\t2F\n" +
                "登山男\t50\t2592\t2F\n" +
                "登山男\t50\t2592\t2F\n" +
                "登山男\t50\t2592\t1F\n" +
                "登山男\t50\t2592\t1F\n" +
                "登山男\t50\t2592\t1F\n" +
                "野餐少女\t45\t1230\t2F\n" +
                "登山男\t50\t2592\t2F\n" +
                "怪物狂\t50\t3948\t2F\n" +
                "野餐少女\t40\t1230\t1F\n" +
                "野餐少女\t40\t1230\t1F\n" +
                "野餐少女\t40\t1230\t1F\n" +
                "8号道路\n" +
                "迷你裙\t45\t984\n" +
                "赌徒\t50\t3780\n" +
                "理科男生\t45\t1728\n" +
                "双胞胎\t45\t1128\n" +
                "迷你裙\t40\t984\n" +
                "理科男生\t45\t1728\n" +
                "迷你裙\t40\t984\n" +
                "迷你裙\t40\t984\n" +
                "暴走族\t45\t1440\n" +
                "暴走族\t45\t1440\n" +
                "赌徒\t50\t3780\n" +
                "理科男生\t45\t1728\n" +
                "\n-----------------------------\n\n" +

                "6号道路\n" +
                "捕虫少年\t40\t720\n" +
                "露营少年\t50\t1380\n" +
                "野餐少女\t40\t1200\n" +
                "捕虫少年\t40\t720\n" +
                "野餐少女\t40\t1380\n" +
                "露营少年\t50\t1380\n" +
                "\n-----------------------------\n\n" +

                "11号道路\n" +
                "短裤小子\t45\t984\n" +
                "赌徒\t50\t3696\n" +
                "电工大叔\t50\t3456\n" +
                "赌徒\t50\t3780\n" +
                "短裤小子\t40\t984\n" +
                "短裤小子\t40\t984\n" +
                "电工大叔\t50\t3456\n" +
                "赌徒\t50\t4032\n" +
                "短裤小子\t40\t984\n" +
                "赌徒\t50\t4032\n" +
                "\n-----------------------------\n\n" +

                "12号道路\n" +
                "垂钓者\t50\t2592\n" +
                "垂钓者\t50\t2484\n" +
                "垂钓者\t50\t2592\n" +
                "垂钓者\t45\t2592\n" +
                "热恋情侣\t45\t1764\n" +
                "电气摇滚\t45\t1728\n" +
                "露营少年\t40\t1260\n" +
                "垂钓者\t25\t1350\n" +
                "\n-----------------------------\n\n" +

                "13号道路\n" +
                "野餐少女\t40\t1200\n" +
                "养鸟人\t50\t2304\n" +
                "野餐少女\t40\t1200\n" +
                "大姐姐\t50\t4032\n" +
                "大姐姐\t50\t4032\n" +
                "野餐少女\t40\t1200\n" +
                "野餐少女\t40\t1200\n" +
                "养鸟人\t50\t2304\n" +
                "养鸟人\t50\t2304\n" +
                "暴走族\t45\t1440\n" +
                "\n-----------------------------\n\n" +

                "14号道路\n" +
                "养鸟人\t50\t2208\n" +
                "养鸟人\t50\t2208\n" +
                "养鸟人\t50\t2208\n" +
                "养鸟人\t50\t2208\n" +
                "养鸟人\t50\t2208\n" +
                "双胞胎\t45\t1128\n" +
                "暴走族\t50\t1410\n" +
                "暴走族\t50\t1410\n" +
                "暴走族\t50\t1410\n" +
                "暴走族\t50\t1410\n" +
                "\n-----------------------------\n\n" +

                "15号道路\n" +
                "养鸟人\t50\t2304\n" +
                "养鸟人\t50\t2208\n" +
                "暴走族\t50\t1410\n" +
                "暴走族\t50\t1410\n" +
                "大姐姐\t50\t4032\n" +
                "大姐姐\t50\t4032\n" +
                "格斗兄妹\t45\t1728\n" +
                "野餐少女\t40\t1230\n" +
                "野餐少女\t40\t1230\n" +
                "野餐少女\t40\t1230\n" +
                "\n-----------------------------\n\n" +

                "18号道路\n" +
                "养鸟人\t50\t2304\n" +
                "养鸟人\t50\t2304\n" +
                "养鸟人\t50\t2304\n" +
                "\n-----------------------------\n\n" +

                "17号道路\n" +
                "暴走族\t45\t1410\n" +
                "暴走族\t45\t1440\n" +
                "暴走族\t45\t1440\n" +
                "暴走族\t45\t1410\n" +
                "暴走族\t45\t1440\n" +
                "暴走族\t45\t1410\n" +
                "暴走族\t45\t1440\n" +
                "暴走族\t45\t1410\n" +
                "暴走族\t45\t1440\n" +
                "暴走族\t45\t1440\n" +
                "\n-----------------------------\n\n" +

                "16号道路\n" +
                "暴走族\t45\t1440\n" +
                "暴走族\t45\t1440\n" +
                "暴走族\t45\t1440\n" +
                "暴走族\t45\t1440\n" +
                "暴走族\t45\t1440\n" +
                "暴走族\t45\t1440\n" +
                "热恋情侣\t45\t1848\n" +
                "\n-----------------------------\n\n" +

                "19号道路\n" +
                "泳裤小子\t50\t288\n" +
                "泳裤小子\t50\t288\n" +
                "泳裤小子\t50\t288\n" +
                "泳裤小子\t50\t288\n" +
                "泳裤小子\t50\t288\n" +
                "泳裤小子\t50\t288\n" +
                "海上姐弟\t50\t288\n" +
                "泳裤小子\t50\t288\n" +
                "比基尼姐\t50\t288\n" +
                "比基尼姐\t50\t288\n" +
                "比基尼姐\t50\t288\n" +
                "\n-----------------------------\n\n" +

                "20号道路\n" +
                "泳裤小子\t50\t288\t东\n" +
                "泳裤小子\t50\t288\t东\n" +
                "比基尼姐\t50\t288\t东\n" +
                "比基尼姐\t50\t288\t东\n" +
                "比基尼姐\t50\t288\t西\n" +
                "野餐少女\t45\t1230\t西\n" +
                "泳裤小子\t50\t288\t西\n" +
                "比基尼姐\t50\t288\t西\n" +
                "养鸟人\t50\t2304\t西\n" +
                "野餐少女\t45\t1230\t西\n" +
                "\n-----------------------------\n\n" +

                "可宝梦屋\n" +
                "短裤小子\t40\t960\t1F\n" +
                "趁火打劫\t50\t3948\t2F\n" +
                "趁火打劫\t50\t4032\t3F\n" +
                "研究员\t45\t3456\t3F\n" +
                "研究员\t45\t3384\t1F\n" +
                "趁火打劫\t50\t3948\tB1F\n" +
                "研究员\t45\t3456\tB1F\n" +
                "\n-----------------------------\n\n" +

                "21号道路\n" +
                "泳裤小子\t50\t288\n" +
                "泳裤小子\t50\t288\n" +
                "泳裤小子\t50\t288\n" +
                "垂钓者\t50\t2592\n" +
                "垂钓者\t50\t2592\n" +
                "泳裤小子\t50\t288\n" +
                "海上姐弟\t45\t288\n" +
                "垂钓者\t50\t2592\n" +
                "垂钓者\t50\t2592\n" +
                "\n-----------------------------\n\n" +

                "冠军之路\n" +
                "菁英情侣\t60\t2016\n" +
                "流浪艺人\t50\t2820\n" +
                "驯兽师\t45\t2640\n" +
                "流浪艺人\t50\t2880\n" +
                "空手道王\t50\t1728\n" +
                "训练家\t45\t2268\n" +
                "训练家\t45\t2268\n" +
                "怪物狂\t50\t4032\n" +
                "训练家\t45\t2268\n" +
                "训练家\t45\t2268\n" +
                "训练家\t45\t2268\n" +
                "训练家\t45\t2268\n" +
                "\n-----------------------------\n\n" +

                "宝物海滩\n" +
                "比基尼姐\t45\t288\n" +
                "\n-----------------------------\n\n" +

                "火照山道\n" +
                "比基尼姐\t45\t288\t需要冲浪\n" +
                "野餐少女\t45\t1200\n" +
                "野营少年\t45\t1290\n" +
                "格斗女孩\t40\t1728\n" +
                "泳裤小子\t50\t276\n" +
                "格斗兄妹\t50\t1728\n" +
                "\n-----------------------------\n\n" +

                "湖心亭\n" +
                "养鸟人\t50\t2304\n" +
                "大姐姐\t50\t4032\n" +
                "\n-----------------------------\n\n" +
                "绿之步道\n" +
                "超能力者\t45\t1440\n" +
                "\n-----------------------------\n\n" +

                "外岛\n" +
                "比基尼姐\t45\t215\n" +
                "海上姐弟\t50\t230\n" +
                "泳裤小子\t50\t240\n" +
                "垂钓者\t45\t2115\n" +
                "\n-----------------------------\n\n" +

                "遗迹山谷\n" +
                "登山男\t50\t2592\n" +
                "怪物狂\t50\t4032\n" +
                "遗迹迷\t50\t3456\n" +
                "遗迹迷\t50\t3312\n" +
                "遗迹迷\t50\t3384\n" +
                "\n-----------------------------\n\n" +

                "训练师之塔\n" +
                "超能力者\t50\t1440\n" +
                "超能力者\t50\t1440\n" +
                "\n-----------------------------\n\n" +

                "溪谷入口\n" +
                "芳香姐姐\t45\t2016\n" +
                "流浪艺人\t50\t2820\n" +
                "保育家\t55\t3024\n" +
                "保育家\t55\t3024\n" +
                "热恋情侣\t50\t1764\n" +
                "\n-----------------------------\n\n" +

                "七宝溪谷\n" +
                "菁英情侣\t60\t1980\n" +
                "驯兽师\t50\t2940\n" +
                "保育家\t55\t2916\n" +
                "保育家\t55\t3024\n" +
                "格斗女孩\t55\t1728\n" +
                "训练家\t50\t2538\n" +
                "训练家\t50\t2538\n" +
                "\n-----------------------------\n\n" +

                "阿斯卡纳遗迹\n" +
                "遗迹迷\t50\t3456\n" +
                "绅士\t45\t4032\n" +
                "画家\t45\t1152\n" +
                "遗迹迷\t50\t3456\n";




        displayArea.setText(content);
    }
}
