package com.example.pokemon.place;

import javafx.event.ActionEvent;
import javafx.fxml.FXML;
import javafx.fxml.FXMLLoader;
import javafx.scene.Node;
import javafx.scene.Parent;
import javafx.scene.Scene;
import javafx.scene.control.TextArea;
import javafx.stage.Stage;

import java.io.FileNotFoundException;
import java.io.IOException;
import java.net.URL;

public class Shenao {
    @FXML
    private void goBack(ActionEvent event) throws IOException {
        URL fxmlUrl = getClass().getResource("/com/example/pokemon/strategy.fxml");
        if (fxmlUrl == null) {
            throw new FileNotFoundException("FXML file not found: /com/example/pokemon/strategy.fxml");
        }
        FXMLLoader loader = new FXMLLoader(fxmlUrl);
        Parent root = loader.load();
        Stage stage = (Stage) ((Node) event.getSource()).getScene().getWindow();
        stage.setScene(new Scene(root));
        stage.show();
    }


    @FXML
    private TextArea displayArea;
    @FXML
    public void initialize() {
        String content ="地点/NPC\t等级\t奖金\n" +
                "219道路\n" +
                "泳圈小孩\t50\t297\n" +
                "泳圈小孩\t50\t297\n" +
                "\n-----------------------------\n\n" +

                "220道路\n" +
                "比基尼姐\t55\t1224\t上端水道\n" +
                "比基尼姐\t55\t1248\t中端水道\n" +
                "泳裤小伙\t55\t1224\t中端水道\n" +
                "泳裤小伙\t55\t1248\t中端水道\n" +
                "比基尼姐\t55\t1224\t中端水道\n" +
                "比基尼姐\t55\t1248\t中端水道\n" +
                "泳裤小伙\t55\t1224\t下端水道\n" +
                "\n-----------------------------\n\n" +

                "221道路\n" +
                "比基尼姐\t55\t1224\t下端水道\n" +
                "泳裤小伙\t55\t1224\t中端水道\n" +
                "垂钓者\t50\t2400\t岸边\n" +
                "精英训练\t50\t4896\n" +
                "精英训练\t50\t4896\n" +
                "收藏家\t50\t3822\n" +
                "\n-----------------------------\n\n" +

                "202道路\n" +
                "短裤小子\t45\t1032\n" +
                "迷你裙\t45\t1032\n" +
                "短裤小子\t45\t1032\n" +
                "\n-----------------------------\n\n" +

                "218道路\n" +
                "垂钓者\t50\t2400\t冲浪\n" +
                "水手\t50\t2400\n" +
                "吉他手\t50\t1836\n" +
                "垂钓者\t50\t2400\t冲浪\n" +
                "\n-----------------------------\n\n" +

                "水脉道馆\n" +
                "空手道王\t55\t1944\t1F\n" +
                "工人\t55\t3120\t2F\n" +
                "工人\t55\t3180\t1F\n" +
                "精英训练\t55\t5184\t1F\n" +
                "工人\t55\t3180\t3F\n" +
                "空手道王\t55\t1944\t3F\n" +
                "精英训练\t55\t5184\t2F\n" +
                "\n-----------------------------\n\n" +

                "钢铁岛\n" +
                "露营少年\t50\t1176\t2F左\n" +
                "野餐少女\t50\t1176\t2F右\n" +
                "工人\t55\t3000\t3F右\n" +
                "工人\t55\t3120\t3F右\n" +
                "登山男\t55\t2448\t3F左\n" +
                "登山男\t55\t2400\t3F左\n" +
                "空手道王\t55\t1872\t3F左\n" +
                "对战女孩\t55\t2496\t3F左\n" +
                "工人\t55\t3060\t3F左\n" +
                "工人\t55\t3000\t3F左\n" +
                "精英训练\t55\t4992\t3F左\n" +
                "精英训练\t55\t4896\t3F左\n" +
                "\n-----------------------------\n\n" +

                "203道路\n" +
                "短裤小子\t45\t1032\n" +
                "短裤小子\t45\t1032\n" +
                "短裤小子\t45\t1056\n" +
                "迷你裙\t45\t1056\n" +
                "迷你裙\t45\t1032\n" +
                "\n-----------------------------\n\n" +

                "钢铁关口\n" +
                "露营少年\t45\t1056\t1F\n" +
                "野餐少女\t45\t1080\t1F\n" +
                "资深训练\t55\t6120\t2F冲浪\n" +
                "\n-----------------------------\n\n" +

                "黑金道馆\n" +
                "短裤小子\t50\t1104\n" +
                "短裤小子\t50\t1104\n" +
                "\n-----------------------------\n\n" +

                "黑金炭坑\n" +
                "工人\t55\t3060\n" +
                "工人\t55\t3000\n" +
                "\n-----------------------------\n\n" +

                "207道路\n" +
                "露营少年\t50\t1104\n" +
                "野餐少女\t50\t1080\n" +
                "登山男\t50\t2208\n" +
                "短裤小子\t45\t1032\n" +
                "登山男\t50\t2256\n" +
                "对战女孩\t50\t2304\n" +
                "\n-----------------------------\n\n" +

                "206道路\n" +
                "骑手\t50\t2256\t自行车道\n" +
                "骑手\t50\t2304\t自行车道\n" +
                "骑手\t50\t2304\t自行车道\n" +
                "骑手\t50\t2256\t自行车道\n" +
                "骑手\t50\t2256\t自行车道\n" +
                "骑手\t50\t2256\t自行车道\n" +
                "骑手\t50\t2256\t自行车道\n" +
                "骑手\t50\t2304\t自行车道\n" +
                "登山男\t50\t2208\t陆地\n" +
                "\n-----------------------------\n\n" +

                "迷幻洞窟\n" +
                "登山男\t50\t2256\n" +
                "登山男\t50\t2256\n" +
                "短裤小子\t45\t1032\n" +
                "迷你裙\t45\t1080\n" +
                "野餐少女\t50\t1104\n" +
                "露营少年\t50\t1104\n" +
                "野餐少女\t50\t1104\n" +
                "露营少年\t50\t1104\n" +
                "收藏家\t50\t3744\n" +
                "遗迹迷\t50\t3384\n" +
                "\n-----------------------------\n\n" +

                "205道路\n" +
                "垂钓者\t45\t2208\t北部\n" +
                "垂钓者\t100\t4800\t北部\n" +
                "垂钓者\t45\t2208\t北部\n" +
                "野餐少女\t50\t1080\t南部\n" +
                "对战女孩\t50\t2256\t南部\n" +
                "登山男\t50\t2208\t南部\n" +
                "露营少年\t50\t1080\t南部\n" +
                "登山男\t50\t2208\t南部\n" +
                "芳香姐姐\t50\t2256\t南部\n" +
                "野餐少女\t50\t1080\t南部\n" +
                "野餐少女\t50\t1080\t南部\n" +
                "\n-----------------------------\n\n" +

                "百代森林\n" +
                "超能力者\t50\t2256\n" +
                "超能力者\t50\t2256\n" +
                "捕虫少年\t45\t1056\n" +
                "捕虫少年\t45\t1056\n" +
                "超能力者\t50\t2256\n" +
                "超能力者\t50\t2256\n" +
                "捕虫少年\t45\t1056\n" +
                "迷你裙\t45\t1080\n" +
                "\n-----------------------------\n\n" +

                "多多罗铁工厂\n" +
                "工人\t55\t3060\n" +
                "工人\t55\t3000\n" +
                "工人\t55\t3060\n" +
                "\n-----------------------------\n\n" +

                "205道路\n" +
                "双胞胎\t45\t1032\t北部\n" +
                "捕虫少年\t45\t1032\t北部\n" +
                "芳香姐姐\t50\t2208\t北部\n" +
                "迷你裙\t45\t1056\t南部\n" +
                "短裤小子\t45\t1056\t南部\n" +
                "迷你裙\t45\t1032\t南部\n" +
                "\n-----------------------------\n\n" +

                "208道路\n" +
                "登山男\t50\t2304\n" +
                "空手道王\t50\t1692\n" +
                "登山男\t50\t2256\t攀岩\n" +
                "垂钓者\t50\t2208\t冲浪\n" +
                "登山男\t50\t2256\n" +
                "芳香姐姐\t50\t2304\n" +
                "艺术家\t\t2592\n" +
                "\n-----------------------------\n\n" +

                "缘之道馆\n" +
                "迷你裙\t50\t1152\n" +
                "短裤小子\t50\t1152\n" +
                "小学生\t50\t1152\n" +
                "小学生\t50\t1152\n" +
                "精英训练\t55\t4896\n" +
                "精英训练\t55\t4896\n" +
                "\n-----------------------------\n\n" +

                "209道路\n" +
                "培育家\t55\t2484\n" +
                "双胞胎\t50\t1080\n" +
                "小朋友\t50\t564\n" +
                "培育家\t55\t2484\n" +
                "牛仔少女\t50\t1152\n" +
                "热恋情侣\t50\t3456\n" +
                "\n-----------------------------\n\n" +

                "迷失塔\n" +
                "短裤小子\t50\t1056\t2F\n" +
                "光头男\t80\t2880\t3F\n" +
                "发烧友\t50\t4032\t3F\n" +
                "发烧友\t50\t4032\t4F\n" +
                "牧场亲子\t50\t7896\t4F\n" +
                "热恋情侣\t50\t3456\n" +
                "\n-----------------------------\n\n" +

                "随意遗迹\n" +
                "遗迹迷\t50\t3456\t3F\n" +
                "\n-----------------------------\n\n" +

                "210道路\n" +
                "牧场大叔\t50\t2256\t南部\n" +
                "牧场亲子\t50\t7896\t南部\n" +
                "培育家\t50\t2538\t南部\n" +
                "双胞胎\t50\t1104\t南部\n" +
                "培育家\t50\t2538\t南部\n" +
                "忍者小子\t50\t882\t中部\n" +
                "忍者小子\t50\t900\t中部\n" +
                "忍者小子\t50\t900\t中部\n" +
                "忍者小子\t50\t900\t北部\n" +
                "精英训练\t50\t4800\t北部\n" +
                "双打组合\t50\t6000\t北部\n" +
                "精英训练\t50\t4896\t北部\n" +
                "驯龙师\t50\t3744\t北部攀岩\n" +
                "忍者小子\t50\t882\t北部\n" +
                "空手道王\t50\t1800\t北部\n" +
                "忍者小子\t50\t900\t北部\n" +
                "养鸟人\t50\t2400\t北部\n" +
                "资深训练\t55\t6240\t北部\n" +
                "\n-----------------------------\n\n" +

                "山后屋咖啡厅\n" +
                "女服务生\t50\t1764\n" +
                "收藏家\t50\t3666\n" +
                "收藏家\t50\t3666\n" +
                "\n-----------------------------\n\n" +

                "211道路\n" +
                "养鸟人\t50\t2448\t东部\n" +
                "遗迹迷\t50\t3600\t东部\n" +
                "忍者小子\t50\t900\t东部\n" +
                "空手道王\t50\t1800\t东部\n" +
                "忍者小子\t50\t864\t西部\n" +
                "登山男\t45\t2256\t西部\n" +
                "养鸟人\t50\t2256\t西部\n" +
                "\n-----------------------------\n\n" +

                "216道路\n" +
                "精英训练\t55\t5724\n" +
                "精英训练\t55\t5616\n" +
                "精英训练\t55\t5616\n" +
                "空手道王\t55\t1872\t攀岩\n" +
                "滑雪者\t55\t2448\t攀岩\n" +
                "滑雪者\t55\t2496\t攀岩\n" +
                "滑雪者\t55\t2544\t攀岩\n" +
                "滑雪者\t55\t2496\n" +
                "精英训练\t55\t5724\n" +

                "\n-----------------------------\n\n" +
                "217道路\n" +
                "精英训练\t55\t5724\n" +
                "空手道王\t55\t1872\n" +
                "滑雪者\t55\t2544\n" +
                "滑雪者\t55\t2496\n" +
                "忍者小子\t50\t918\n" +
                "滑雪者\t55\t2544\n" +
                "忍者小子\t50\t918\n" +
                "滑雪者\t55\t2496\n" +
                "精英训练\t55\t5616\n" +
                "\n-----------------------------\n\n" +

                "切锋道馆\n" +
                "精英训练\t55\t5940\n" +
                "精英训练\t55\t5940\n" +
                "精英训练\t55\t5940\n" +
                "精英训练\t55\t5940\n" +
                "精英训练\t55\t5940\n" +
                "\n-----------------------------\n\n" +

                "212道路\n" +
                "警察先生\t50\t3000\t北部晚上\n" +
                "警察先生\t50\t3000\t北部晚上\n" +
                "警察先生\t50\t3000\t北部晚上\n" +
                "女士\t50\t6000\t北部\n" +
                "绅士\t50\t5880\t北部\n" +
                "警察先生\t50\t3000\t北部晚上\n" +
                "富家少爷\t50\t6000\t北部\n" +
                "千金小姐\t50\t6000\t北部\n" +
                "巡护员\t50\t4590\t南部\n" +
                "巡护员\t50\t4500\t南部\n" +
                "研究员\t50\t3528\t南部\n" +
                "警察先生\t50\t3000\t南部晚上\n" +
                "收藏家\t50\t3744\t南部\n" +
                "垂钓者\t50\t2352\t南部\n" +
                "垂钓者\t50\t2400\t南部\n" +
                "垂钓者\t50\t2352\t南部\n" +
                "阳伞姐姐\t50\t2352\t南部\n" +
                "巡护员\t50\t4590\t南部\n" +
                "研究员\t50\t3528\t南部\n" +
                "阳伞姐姐\t50\t2352\t南部\n" +
                "\n-----------------------------\n\n" +

                "湿原道馆\n" +
                "泳圈小孩\t50\t300\n" +
                "垂钓者\t55\t2496\n" +
                "水手\t55\t2496\n" +
                "泳圈小孩\t50\t300\n" +
                "垂钓者\t55\t2496\n" +
                "水手\t55\t2496\n" +
                "\n-----------------------------\n\n" +

                "213道路\n" +
                "大姐姐\t50\t4116\n" +
                "垂钓者\t50\t2400\n" +
                "泳圈小孩\t50\t282\n" +
                "泳圈小孩\t50\t282\n" +
                "比基尼姐\t50\t1200\n" +
                "水手\t50\t1568\n" +
                "泳裤小伙\t50\t1200\n" +
                "泳裤小伙\t50\t1224\n" +
                "比基尼姐\t50\t1200\n" +
                "\n-----------------------------\n\n" +
                "214道路\n" +
                "超能力者\t50\t2352\n" +
                "赌徒\t50\t9000\n" +
                "收藏家\t50\t3666\n" +
                "大姐姐\t50\t4116\n" +
                "超能力者\t50\t2400\n" +
                "收藏家\t50\t3666\n" +
                "遗迹迷\t50\t3528\n" +
                "收藏家\t50\t3744\n" +
                "遗迹迷\t50\t3528\n" +
                "\n-----------------------------\n\n" +

                "帷幕道馆\n" +
                "空手道王\t55\t1872\n" +
                "空手道王\t55\t1872\n" +
                "空手道王\t55\t1872\n" +
                "空手道王\t55\t1872\n" +
                "\n-----------------------------\n\n" +

                "215道路\n" +
                "精英训练\t50\t4704\n" +
                "精英训练\t50\t4704\n" +
                "空手道王\t50\t1764\n" +
                "空手道王\t50\t1764\n" +
                "空手道王\t50\t1764\n" +
                "遗迹迷\t50\t3456\n" +
                "\n-----------------------------\n\n" +

                "222道路\n" +
                "富家少爷\t55\t6360\n" +
                "大姐姐\t50\t4368\n" +
                "警察先生\t50\t3120\t晚上\n" +
                "泳圈小孩\t50\t300\n" +
                "水手\t50\t2496\n" +
                "水手\t55\t2496\n" +
                "垂钓者\t55\t2448\n" +
                "垂钓者\t55\t2544\n" +
                "垂钓者\t55\t2496\n" +
                "垂钓者\t55\t2496\n" +
                "泳圈小孩\t50\t294\n" +
                "小朋友\t50\t600\t皮卡丘屋\n" +
                "\n-----------------------------\n\n" +

                "滨海道馆\n" +
                "小学生\t55\t1272\n" +
                "小学生\t55\t1272\n" +
                "吉他手\t60\t2016\n" +
                "小朋友\t55\t636\n" +
                "吉他手\t60\t2016\n" +
                "精英训练\t60\t5376\n" +
                "吉他手\t60\t2016\n" +
                "\n-----------------------------\n\n" +

                "223道路\n" +
                "比基尼姐\t55\t1296\t冲浪\n" +
                "比基尼姐\t55\t1296\t冲浪\n" +
                "泳裤小伙\t55\t1272\n" +
                "比基尼姐\t55\t1272\n" +
                "泳裤小伙\t55\t1272\n" +
                "泳裤小伙\t55\t1272\n" +
                "比基尼姐\t55\t1272\n" +
                "泳裤小伙\t55\t1272\n" +
                "水手\t55\t2496\n" +
                "比基尼姐\t55\t1272\n" +
                "比基尼姐\t55\t1272\n" +
                "泳裤小伙\t55\t1272\n" +
                "泳裤小伙\t55\t1296\n" +
                "\n-----------------------------\n\n" +
                "冠军之路\n" +
                "养鸟人\t55\t2544\t1F\n" +
                "超能力者\t55\t2592\t1F\n" +
                "精英训练\t55\t5280\t1F\n" +
                "精英训练\t55\t5088\t2F\n" +
                "精英训练\t55\t5184\t2F\n" +
                "资深训练\t55\t6480\t2F\n" +
                "双打组合\t55\t6360\t2F\n" +
                "空手道王\t55\t1944\t1F\n" +
                "超能力者\t55\t2544\tB1F冲浪\n" +
                "精英训练\t55\t5280\tB1F冲浪\n" +
                "驯龙师\t55\t3960\tB1F攀瀑\n" +
                "双打组合\t55\t6360\tB1F冲浪\n" +
                "资深训练\t55\t6600\t1F\n" +
                "驯龙师\t55\t3888\t1F\n" +
                "精英训练\t60\t5568\t里层\n" +
                "精英训练\t60\t5472\t里层\n" +
                "超能力者\t60\t2736\t里层\n" +
                "超能力者\t60\t2736\t里层\n" +
                "资深训练\t60\t6960\t里层\n" +
                "空手道王\t60\t2052\t里层\n" +
                "驯龙师\t60\t4176\t里层\n" +
                "养鸟人\t60\t2688\t里层\n" +
                "超能力者\t60\t2736\t里层\n" +
                "超能力者\t60\t2736\t里层\n" +
                "资深训练\t60\t6960\t里层\n" +
                "空手道王\t60\t2052\t里层\n" +
                "精英训练\t60\t5472\t里层冲浪\n" +
                "精英训练\t60\t5472\t里层冲浪\n" +
                "\n-----------------------------\n\n" +

                "224道路\n" +
                "精英训练\t60\t5568\n" +
                "资深训练\t60\t6960\n" +
                "超能力者\t60\t2784\n" +
                "超能力者\t60\t2784\t冲浪\n" +
                "空手道王\t60\t2052\n" +
                "遗迹迷\t60\t4176\n" +
                "精英训练\t60\t5760\n" +
                "驯龙师\t60\t4176\n" +
                "\n-----------------------------\n\n" +

                "225道路\n" +
                "养鸟人\t60\t2688\n" +
                "巡护员\t60\t5220\n" +
                "超能力者\t60\t2736\n" +
                "巡护员\t60\t5220\n" +
                "精英训练\t60\t5472\n" +
                "精英训练\t60\t5472\n" +
                "精英训练\t60\t5472\n" +
                "驯龙师\t60\t4176\t攀岩\n" +
                "\n-----------------------------\n\n" +

                "226道路\n" +
                "精英训练\t60\t5568\t攀岩\n" +
                "驯龙师\t60\t4176\t攀岩\n" +
                "养鸟人\t60\t2688\t攀岩\n" +
                "比基尼姐\t60\t1392\t冲浪\n" +
                "泳装小伙\t60\t1392\t冲浪\n" +
                "\n-----------------------------\n\n" +

                "227道路\n" +
                "精英训练\t60\t5856\n" +
                "巡护员\t60\t5400\n" +
                "精英训练\t60\t5856\n" +
                "空手道王\t60\t2088\n" +
                "\n-----------------------------\n\n" +

                "严酷山\n" +
                "驯龙师\t60\t4320\t外部\n" +
                "超能力者\t60\t2832\t内部\n" +
                "超能力者\t60\t2880\t内部\n" +
                "驯龙师\t60\t4320\t内部\n" +
                "资深训练\t60\t7200\t内部\n" +
                "精英训练\t60\t5760\t内部\n" +
                "精英训练\t60\t5664\t内部\n" +
                "空手道王\t60\t2088\t内部\n" +
                "养鸟人\t60\t2832\t内部\n" +
                "精英训练\t60\t5664\t内部\n" +
                "精英训练\t60\t5664\t内部\n" +
                "精英训练\t60\t5856\t内部\n" +
                "精英训练\t60\t5856\t内部\n" +
                "驯龙师\t60\t4320\t内部\n" +
                "空手道王\t60\t2160\t内部\n" +
                "精英训练\t60\t5760\t内部\n" +
                "精英训练\t60\t5664\t内部\n" +
                "\n-----------------------------\n\n" +
                "229道路\n" +
                "精英训练\t60\t5472\n" +
                "精英训练\t60\t5472\n" +
                "精英训练\t60\t5568\n" +
                "\n-----------------------------\n\n" +

                "228道路\n" +
                "精英训练\t60\t5664\n" +
                "超能力者\t60\t2784\n" +
                "巡护员\t60\t5310\n" +
                "巡护员\t60\t5310\n" +
                "驯龙师\t60\t4248\n" +
                "精英训练\t60\t5568\n" +
                "空手道王\t60\t2088\n" +
                "精英训练\t60\t5568\n" +
                "\n-----------------------------\n\n" +

                "230道路\n" +
                "泳裤小伙\t60\t1368\n" +
                "比基尼姐\t60\t1368\n" +
                "比基尼姐\t60\t1368\n" +
                "泳裤小伙\t60\t1368\n" +
                "泳裤小伙\t60\t1368\n" +
                "比基尼姐\t60\t1368\n";



        displayArea.setText(content);
    }
}
